import yfinance as yf
import pandas as pd
import matplotlib.pyplot as plt

# 1. Отримайте історичні ринкові дані для вибраного фінансового інструменту.
# Ці дані повинні включати основні показники,
# такі як ціна відкриття, ціна закриття, максимум, мінімум і обсяг торгів.
data = yf.download("AAPL", start="2025-01-01", end="2026-01-01")

# 2. Організуйте отримані дані в структурований формат, наприклад DataFrame,
# гарантуючи, що вони чисті та готові для аналізу.
print(data.head())
# перевірка перших 5 рядків
print(data.info())
# інформація про DataFrame (стовпці, типи даних, кількість записів)
data = data.dropna()
# видалення пропущених значень (якщо вони є)
print(data.describe())
# основна статистика по числових даних


